carrino/Adafruit_nRF52_Arduino/boards.txt
menu.softdevice=SoftDevice
menu.debug=Debug

# -----------------------------------
# Adafruit Feather nRF52832
# -----------------------------------
feather52832.name=Adafruit Feather nRF52832

# VID/PID for Bootloader, Arduino & CircuitPython

# Upload
feather52832.bootloader.tool=bootburn
feather52832.upload.tool=nrfutil
feather52832.upload.protocol=nrfutil
feather52832.upload.use_1200bps_touch=false
feather52832.upload.wait_for_upload_port=false
feather52832.upload.native_usb=false
feather52832.upload.maximum_size=290816
feather52832.upload.maximum_data_size=52224

# Build
feather52832.build.mcu=cortex-m4
feather52832.build.f_cpu=64000000
feather52832.build.board=NRF52832_FEATHER
feather52832.build.core=nRF5
feather52832.build.variant=feather_nrf52832
feather52832.build.usb_manufacturer="Adafruit"
feather52832.build.usb_product="Feather nRF52832"
feather52832.build.extra_flags=-DNRF52832_XXAA -DNRF52
feather52832.build.ldscript=nrf52832_s132_v6.ld

# SoftDevice Menu
feather52832.menu.softdevice.s132v6=S132 6.1.1
feather52832.menu.softdevice.s132v6.build.sd_name=s132
feather52832.menu.softdevice.s132v6.build.sd_version=6.1.1
feather52832.menu.softdevice.s132v6.build.sd_fwid=0x00B7

# Debug Menu
feather52832.menu.debug.l0=Level 0 (Release)
feather52832.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52832.menu.debug.l1=Level 1 (Error Message)
feather52832.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52832.menu.debug.l2=Level 2 (Full Debug)
feather52832.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52832.menu.debug.l3=Level 3 (Segger SystemView)
feather52832.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather52832.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -----------------------------------
# Adafruit Feather nRF52840 Express
# -----------------------------------
feather52840.name=Adafruit Feather nRF52840 Express

# VID/PID for Bootloader, Arduino & CircuitPython
feather52840.vid.0=0x239A
feather52840.pid.0=0x8029
feather52840.vid.1=0x239A
feather52840.pid.1=0x0029
feather52840.vid.2=0x239A
feather52840.pid.2=0x002A
feather52840.vid.3=0x239A
feather52840.pid.3=0x802A

# Upload
feather52840.bootloader.tool=bootburn
feather52840.upload.tool=nrfutil
feather52840.upload.protocol=nrfutil
feather52840.upload.use_1200bps_touch=true
feather52840.upload.wait_for_upload_port=true
feather52840.upload.maximum_size=815104
feather52840.upload.maximum_data_size=237568

# Build
feather52840.build.mcu=cortex-m4
feather52840.build.f_cpu=64000000
feather52840.build.board=NRF52840_FEATHER
feather52840.build.core=nRF5
feather52840.build.variant=feather_nrf52840_express
feather52840.build.usb_manufacturer="Adafruit"
feather52840.build.usb_product="Feather nRF52840 Express"
feather52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
feather52840.build.ldscript=nrf52840_s140_v6.ld
feather52840.build.vid=0x239A
feather52840.build.pid=0x8029

# SoftDevice Menu
feather52840.menu.softdevice.s140v6=S140 6.1.1
feather52840.menu.softdevice.s140v6.build.sd_name=s140
feather52840.menu.softdevice.s140v6.build.sd_version=6.1.1
feather52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
feather52840.menu.debug.l0=Level 0 (Release)
feather52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52840.menu.debug.l1=Level 1 (Error Message)
feather52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52840.menu.debug.l2=Level 2 (Full Debug)
feather52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52840.menu.debug.l3=Level 3 (Segger SystemView)
feather52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -----------------------------------
# TechDisc nrf52833
# -----------------------------------
techdisc52833.name=TechDisc nrf52833

# VID/PID for Bootloader, Arduino & CircuitPython
#techdisc52833.vid.0=0x239A
#techdisc52833.pid.0=0x8087
#techdisc52833.vid.1=0x239A
#techdisc52833.pid.1=0x0087
#techdisc52833.vid.2=0x239A
#techdisc52833.pid.2=0x0088
#techdisc52833.vid.3=0x239A
#techdisc52833.pid.3=0x8088

# Upload
techdisc52833.bootloader.tool=bootburn
techdisc52833.upload.tool=nrfutil
techdisc52833.upload.protocol=nrfutil
techdisc52833.upload.use_1200bps_touch=true
techdisc52833.upload.wait_for_upload_port=true
techdisc52833.upload.maximum_size=290816
techdisc52833.upload.maximum_data_size=52224

# Build
techdisc52833.build.mcu=cortex-m4
techdisc52833.build.f_cpu=64000000
techdisc52833.build.board=GENERIC_NRF52833
techdisc52833.build.core=nRF5
techdisc52833.build.variant=techdisc_nrf52833
techdisc52833.build.usb_manufacturer="TechDisc LLC"
techdisc52833.build.usb_product="TechDisc nrf52833"
techdisc52833.build.extra_flags=-DNRF52833_XXAA {build.flags.usb}
techdisc52833.build.ldscript=nrf52833_s140_v6.ld
techdisc52833.build.vid=0x1915
techdisc52833.build.pid=0x521F

# SoftDevice Menu
techdisc52833.menu.softdevice.s140v6=S140 6.1.1
techdisc52833.menu.softdevice.s140v6.build.sd_name=s140
techdisc52833.menu.softdevice.s140v6.build.sd_version=6.1.1
techdisc52833.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
techdisc52833.menu.debug.l0=Level 0 (Release)
techdisc52833.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
techdisc52833.menu.debug.l1=Level 1 (Error Message)
techdisc52833.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
techdisc52833.menu.debug.l2=Level 2 (Full Debug)
techdisc52833.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
techdisc52833.menu.debug.l3=Level 3 (Segger SystemView)
techdisc52833.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
techdisc52833.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -----------------------------------
# TechDisc nrf52840
# -----------------------------------
techdisc52840.name=TechDisc nrf52840

# VID/PID for Bootloader, Arduino & CircuitPython
techdisc52840.vid.0=0x239A
techdisc52840.pid.0=0x8087
techdisc52840.vid.1=0x239A
techdisc52840.pid.1=0x0087
techdisc52840.vid.2=0x239A
techdisc52840.pid.2=0x0088
techdisc52840.vid.3=0x239A
techdisc52840.pid.3=0x8088

# Upload
techdisc52840.bootloader.tool=bootburn
techdisc52840.upload.tool=nrfutil
techdisc52840.upload.protocol=nrfutil
techdisc52840.upload.use_1200bps_touch=true
techdisc52840.upload.wait_for_upload_port=true
techdisc52840.upload.maximum_size=815104
techdisc52840.upload.maximum_data_size=237568

# Build
techdisc52840.build.mcu=cortex-m4
techdisc52840.build.f_cpu=64000000
techdisc52840.build.board=NRF52840_FEATHER_SENSE
techdisc52840.build.core=nRF5
techdisc52840.build.variant=feather_nrf52840_sense
techdisc52840.build.usb_manufacturer="Adafruit"
techdisc52840.build.usb_product="Feather nRF52840 Sense"
techdisc52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
techdisc52840.build.ldscript=nrf52840_s140_v6.ld
techdisc52840.build.vid=0x239A
techdisc52840.build.pid=0x8087

